Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.CombinedDimensionAttributes.MinimumNumberToCombine Property
 The minimum number of dimensions to be combined.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public int MinimumNumberToCombine { get; set; }
Public Property MinimumNumberToCombine As Integer
	Get
	Set
Property Value
Type: Int32
See Also
Reference
DimensionSetBaseAttributes.CombinedDimensionAttributes Class
Tekla.Structures.Drawing Namespace